package part01.homework.day01;

/**
 * @author El Baron 02.07.2024
 * Вывести на экран слово “JAVA”, в столбик, чтобы оно повторилось 10 раз,
 * используя цикл на ваше усмотрение (for или while).
 */
public class Task03 {
    public static void main(String[] args) {
        int i = 10;
        while (i > 0){
            System.out.println("JAVA");
            i--;
        }

    }
}
